tests/integration/old_fsc_feed.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://api.gladmindsplatform.co/api/v1/bajaj/feed/">
  <SOAP-ENV:Body>
    <ns1:postOldFsc>
      <ns1:ObjectList>
        <ns1:OldFSCData>
            <ns1:GT_OLD_FSC>
              <ns1:OldFscItem>
	            <ns1:MATNR>HSR</ns1:MATNR>                
	            <ns1:SERVICE>2</ns1:SERVICE>                
	            <ns1:KUNNAR>GMDEALER001</ns1:KUNNAR>
                <ns1:CHASSIS>XXXXXXXXXX</ns1:CHASSIS>
	            <ns1:CHARG>ASC001</ns1:CHARG>
             </ns1:OldFscItem>
            </ns1:GT_OLD_FSC>
            <ns1:GT_STATUS>
	            <ns1:STATUS>2</ns1:STATUS>
	            <ns1:TIMESTAMP>2013-12-11183000</ns1:TIMESTAMP>
            </ns1:GT_STATUS>
        </ns1:OldFSCData>
      </ns1:ObjectList>
      <ns1:Credential>
        <ns1:UserName>gladminds</ns1:UserName>
        <ns1:Password>gladminds</ns1:Password>
      </ns1:Credential>
    </ns1:postOldFsc>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>